Tekla Open API Reference for Tekla Structures 2025
IndirectPolymeshEdge.EdgeType Property
 Type of the edge.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolymeshEdgeTypeEnum EdgeType { get; set; }
Public Property EdgeType As PolymeshEdgeTypeEnum
	Get
	Set
Property Value
Type: PolymeshEdgeTypeEnum
See Also
Reference
IndirectPolymeshEdge Class
Tekla.Structures.Geometry3d Namespace